{"mep": "Irene TINAGLI", "summaries": ["Irene Tinagli, Chair of the Committee on Economic and Monetary Affairs, delivered speeches on various topics that are of great importance to her. The main topics she focused on include the appointment of key positions in the European Central Bank, the need for gender balance in European institutions, tax justice and reform, conflicts of interest in post-public employment, the role of the European Banking Authority, and the Recovery and Resilience Facility.\n\nTinagli emphasized the significance of the European Central Bank in maintaining the stability of the euro and the importance of appointing qualified individuals to key positions within the institution. She highlighted the need for gender balance in European institutions and called for transparent selection processes that promote equal opportunities for men and women.\n\nFurthermore, Tinagli addressed the issue of tax justice and the need for reform to ensure that large multinational corporations pay their fair share of taxes. She also raised concerns about conflicts of interest in post-public employment and called for a review of current practices at both European and national levels.\n\nAdditionally, Tinagli discussed the role of the European Banking Authority in regulating the financial sector and the importance of preventing conflicts of interest in the transition from public to private sector positions. She called on the Commission to assess current practices and implement a harmonized legal framework to address these issues.\n\nLastly, Tinagli expressed support for the Recovery and Resilience Facility as a crucial step towards a closer and deeper union in Europe. She emphasized the need for a European approach to economic and budgetary measures to foster territorial cohesion, fight social inequalities, and support policies for the next generation of Europeans.\n\nOverall, Irene Tinagli's speeches reflect her commitment to promoting transparency, accountability, and fairness in European institutions, as well as her dedication to addressing key economic and monetary challenges facing the European Union.", "Irene Tinagli, a European Member of Parliament, has delivered several speeches on various topics that are of great importance to her. One of the key topics she focuses on is the InvestEU program, which she views as a crucial tool for recovery and resilience in the face of economic challenges such as the financial crisis of 2008 and the COVID-19 pandemic. Tinagli emphasizes the importance of placing InvestEU at the heart of Next Generation EU and highlights its role in supporting small and medium-sized enterprises (SMEs) through capital support.\n\nAnother significant topic for Tinagli is tax justice and combating tax evasion and fraud. She welcomes the Commission's support for a strong global agreement to address these issues and stresses the need for a minimum effective taxation for multinationals. Tinagli also advocates for measures to neutralize the misuse of shell companies as part of the fight against tax avoidance.\n\nAdditionally, Tinagli is passionate about transparency and accountability in corporate practices. She celebrates the agreement on public country-by-country reporting, which will require big multinationals to disclose their profits, taxes paid, and other financial information. This transparency, she believes, will help identify companies that are not contributing their fair share to society.\n\nFurthermore, Tinagli addresses the importance of the Recovery and Resilience Facility in supporting the green and digital transitions, as well as social policies to improve the lives of European citizens. She emphasizes the need for successful implementation of national plans to accelerate recovery and build a better and fairer Europe.\n\nLastly, Tinagli reflects on the 20th anniversary of the euro and its significance in the European Union. She praises the euro for its role in strengthening European economies, preserving monetary sovereignty, and promoting peace and unity. However, she acknowledges that the Economic and Monetary Union is still incomplete and calls for necessary changes to ensure its benefits reach all Member States and citizens.\n\nIn conclusion, Irene Tinagli's speeches highlight her dedication to promoting economic recovery, tax justice, transparency, and the advancement of the European Union through initiatives such as InvestEU, tax reforms, and the Recovery and Resilience Facility. Her focus on these topics underscores her commitment to addressing key challenges and building a more resilient and equitable Europe.", "Irene Tinagli, a Member of the European Parliament from the S&D group, has delivered several speeches addressing key issues such as the need for a European Recovery Fund, fiscal capacity at the European level, the rising cost of energy, and the importance of investments in renewable energy production. She emphasizes the need for further action to address external shocks like the Russian aggression and the current energy crisis. Tinagli also highlights the importance of providing support to countries with limited fiscal space and restoring the single market to address the challenges posed by high energy prices.\n\nShe calls for urgent intervention on the energy market, including joint procurement and decoupling gas from energy prices, to prevent further economic challenges and potential recession in the European Union. Tinagli stresses the importance of more resources and reforms in the energy market to address the current crisis effectively. She also raises concerns about the need for clarity on national investments and the treatment of such investments in the legislative proposal.\n\nAdditionally, Tinagli discusses the accountability of the European Central Bank (ECB) and the importance of balancing independence with accountability. She acknowledges the need for a fully fledged bank crisis management framework to prevent financial dominance and ensure the stability of the banking system. Tinagli also emphasizes the importance of credibility in economic governance and the need for sustainable rules to support public and private investments for future growth and job creation.\n\nIn her speeches, Tinagli advocates for a concerted income policy involving businesses, workers, and governments to address inflation and support monetary policy effectively. She emphasizes the role of procompetitive policies in preventing unjustified price increases and stresses the importance of working together to lower inflation expectations and support monetary policy. Overall, Irene Tinagli's speeches highlight her focus on addressing key economic challenges, promoting sustainable investments, and ensuring effective governance to support the well-being of citizens and the competitiveness of European businesses."], "final_summary": "Irene Tinagli, a Member of the European Parliament from the S&D group, has delivered several speeches focusing on key issues such as the Recovery Fund, energy crisis, fiscal capacity at the European level, and the need for structural reforms in the energy market. She emphasizes the importance of completing the economic and monetary union to better cope with external shocks like the Russian aggression and the current energy crisis.\n\nTinagli highlights the need for a genuine European instrument to support countries with limited fiscal space and restore the single market. She calls for ambitious interventions in the energy market, including joint procurement and decoupling gas from energy prices. She stresses the importance of more resources and reforms to address the challenges posed by the energy crisis, such as a new benchmark for gas prices and the decoupling of gas and electricity prices.\n\nAdditionally, Tinagli addresses the issue of accountability and independence of the European Central Bank (ECB), emphasizing the need for a balance between the two. She acknowledges the progress made in holding the ECB accountable and calls for further steps to reinforce citizens' trust and silence skeptics.\n\nFurthermore, Tinagli discusses the impact of the war in Ukraine on the EU's economy and the need for coordinated fiscal, structural, and regulatory policies to support household incomes and companies affected by high energy costs. She calls for an urgent review of the EU fiscal framework and proposes reforms to strengthen economic governance and crisis resolution measures.\n\nIn her speeches, Tinagli also touches upon the importance of completing the banking union to prevent financial dominance and ensure a fully-fledged bank crisis management framework. She advocates for a balance between ambition and credibility in economic governance, emphasizing the need for public investments to drive growth and meet citizens' expectations.\n\nOverall, Irene Tinagli's speeches revolve around key topics such as the Recovery Fund, energy crisis, fiscal capacity, accountability of the ECB, economic governance, and the completion of the banking union. She calls for ambitious interventions and structural reforms to address current challenges and ensure sustainable economic growth in the EU."}